In [ ]:
Q.1

In [ ]:
a database is an organized collection of structured information or data, trypically stroed electronically in a computer system

In [ ]:
SQL :-                                                            

Relational Database management
system.

Vertically scalable.

Fixed or predifined schema

Not suitable for hierarchical
data storage.

can be used for complex queries.

In [ ]:
No SQL :-

Distributed Database management system.

Horizontally scalable.

Dynamic Schema.

Best suitable for hierar chicaldata 
storage.

Not good for complex queries.

In [ ]:
Q.2

In [ ]:
DDL is a standardized language with commands to define the storage group ( storgroups )
different structures and objects in a database.

In [ ]:
The TRUNCATE TAPLE command deletes the data inside a table, but not table itself.

In [ ]:
Examples :-

In [ ]:
1) TRUNCATE :-
               TRUNCATE command is used to.....
    Example:- Truncate table table name

In [ ]:
2) DROP:-
         DROP command is used to .....
    Example:- drop table table name

In [ ]:
3) CREATE TABLE person( 
    person ID int,
    Last name varchar (255),
    First name varchar (255),
    Address varchar (255),
    City varchar ( 255),

In [ ]:
4) ALTER TABLE customers
   ADD Email varchar ( 255 );

In [ ]:
Q.3

In [ ]:
A data manipulation language (DML) is a family of computer languages inculiding comande permitting 
users to manipulate data in a database.

In [ ]:
1) INSERT statement indroduces new rows into an existing table

In [ ]:
Example:-

In [ ]:
TNSERT INTO Customer
( cast ID, customer name, age, city, salary) VALUES

( 1,' sam; 26.' Delhi, 9000),
( 2,' Ram; 19.' Bangalore, 110000), 
( 3,' Pam; 31.' Mumbai, 6000),
( 4,' Jam; 42.' pune, 10000),

In [ ]:
2) The DELETE statement removes a row or combination of rows from a table

In [ ]:
Example :-

In [ ]:
DELETE FROM customer 
WHERE cust ID= 3

In [ ]:
3) The UPDATE statement enables users to updates a rows or groups of rows
in a table.

In [ ]:
Examples:-

In [ ]:
UPDATES customers
SET cust name = ' xam', Age= 32 
WHERE Cust ID = 4;

In [ ]:
Q.4

In [ ]:
Data Query Language (DQL) 

Query language, often know as DQL or data Query Languages, are computer language that are used to 
make various query in information system & databases.

In [ ]:
SELECT statements is used to select data from a databse.

In [ ]:
Examples:-

In [ ]:
SELECT < column__one >,
< Column__Two >,.... FROM
< Column__One >=
< Column__Value >;

In [ ]:
Q.5

In [ ]:
1) Primary Key:- 
             A primary key is a column in a table that uniquely indefifies each row in the table.
It cannot contain null values and must be unique across all rows in the table.

In [ ]:
2)  Foreign Key:-
              A foreign key is a column in a table that refers to the primary key in another table. 
It is used to establish a link between the two tables and used to enforce referentail inteqirity in the 
Database.

In [ ]:
Q.6

In [ ]:
import mysql.connector

In [ ]:
cnx= mysql.connector

In [ ]:
connect ( user= ' scott: password= ' password
         host= ' 127 .0.0.1;
         database =' employees") 
cnx.close()

In [ ]:
# python cursor___object.python

In [ ]:
# import the libary
import mysql.connector

In [ ]:
# creating connect
conn= mysql.connector. connect(
    host= " local host",
    users= " sammy",
    password=password
)

In [ ]:
# print the connection
print ( conn )
# import the cursor from the connection

In [ ]:
mycursor= conn. cursor()
# print the my cursor
print (my cursor)

In [ ]:
Q.7

In [ ]:
SQL queries adhere to a specific order when wvaluating clauses, similar to how mathematical operationa
adhere to PEMDAS or BODMADS.

In [ ]:
Example:-

In [ ]:
SELECT 0 name, 
        SUM ( 0 quantity* p.price) As total spent FROM orders 0
JOIN Product P 
     ON 0 product__id= p.id
WHERE P. name = 'pen'
GROUP By. 0. name
ORDER By total___spent DECS
LIMIT 1 OFFSET 1;